app/controllers/characters_controller.rb

  def index
    render json: Character.all, status: 200
---
SELECT "characters".* FROM "characters"

  def create
    @character = Character.new(name: params[:name], gender: params[:gender], creator: params[:creator])
    if @character.save
---
INSERT INTO "characters" ("name", "gender", "creator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asda"], ["gender", "asdasf"], ["creator", "afas"], ["created_at", "2016-05-05 17:40:29.006731"], ["updated_at", "2016-05-05 17:40:29.006731"]]

  def show
    @character = Character.find(params[:id])
    render json: Character.all, status: 200
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 4]]
SELECT "characters".* FROM "characters"

  def destroy
    @character = Character.find(params[:id])
    @character.destroy
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]